Revit 2027 API
IFCAnyHandle.SetAttribute(String, ISet<String>) Method
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetAttribute(
	string name,
	ISet<string> values
)
Public Sub SetAttribute (
	name As String,
	values As ISet(Of String)
)
public:
void SetAttribute(
	String^ name,
	ISet<String^>^ values
)
member SetAttribute :
        name : string *
        values : ISet<string> -> unit
Parameters
name String
values ISet<String>
See Also
Reference
IFCAnyHandle Class
SetAttribute Overload
Autodesk.Revit.DB.IFC Namespace